// 6_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream> 
#include "stdio.h"
#define _CRT_SECURE_NO_WARNINGS 
using namespace std;


int main()
{
    int a, b, c, d, result;

    char s; printf_s("\n\rInput A: ");
    scanf_s("%d", &a); 
    printf_s("\n\rInput B: ");
    scanf_s("%d", &b);
    printf_s("\n\rInput C: "); 
    scanf_s("%d", &c); 
    printf_s("\n\rInput D: ");
    scanf_s("%d", &d);
    _asm
    {
        mov eax, [c]
        imul eax
        sub eax,[d]
        mov ebx, eax
        mov eax, [a]
        imul eax,[b]
        add eax, ebx
        mov result,eax

        
    }
    printf_s("\nResult: %d", result); 
    scanf_s("%1c", &s);
    return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
